#include "Array.h"
#include "Statistics.h"
using namespace std;

//Функція перевірки введених даних на корректність. Необхідно вводити лише числові значення
void get_correct_input(int& value) {
    cin >> value;

    while (cin.fail()) {
        cin.clear();
        cin.ignore(numeric_limits<streamsize>::max(), '\n');
        cout << "Invalid input. Please try again: ";
        cin >> value;
    }
}

int main()
{
    srand(time(NULL));  //Запускаємо рандомайзер
    const int NumberOfSortType = 2;  //Кількість методів сортування (якщо необхідно додати їх до классу Array)
    Statistic analysis(NumberOfSortType);  //Змінна класу Statistics. Передаємо їй кількість методів сортувань
    Array arrayToSort[NumberOfSortType];  //Створюємо масив нашого класу (виходить масив масивів), також по кількості методів сортувань, тому що сотрувати треба одне і теж саме
    int arraySize = 0, choice;  //Змінна для зберігяння розміру масиву та нашого вибору 

    //Цикл у якому питаємо, що хоче користувач, та відповідно реагуємо на його вибір
    do {
        //Цикл у якому питаємо, чим заповнити масив нулями або випадковим числами
        do {
            cout << endl;
            cout << " * * * * * * * * * * * * * * * * * * * * * * * * * * *" << endl;
            cout << " * Enter the desired option for filling the array:   *" << endl;
            cout << " *\t1 - Fill with zero values                    *" << endl;
            cout << " *\t2 - Fill with random values                  *" << endl;
            cout << " *\t0 - Exit                                     *" << endl;
            cout << " * * * * * * * * * * * * * * * * * * * * * * * * * * *" << endl;
            cout << "\t\t\t\t        Your choice: ";

            get_correct_input(choice);  //Перевіряємо введене значення
        } while (choice < 0 || choice > 2);  //Повторюємо цикл поки вводять некорректні значення

         //Якщо вибір не нуль то питаємо розмір масиву
        if (choice > 0) {
            do {
                cout << "Input array size: ";
                get_correct_input(arraySize);
            } while (arraySize < 1);  //Повторюємо запит поки не введуть коректні значення
        }

        //Викликаємо конструктор з вказівкою діапазону випадкових чисел (якщо обрали нульовий масив, то 500*(1-1) дасть 0, та масив заповниться нулями)
        Array blank(arraySize, 500 * (choice - 1));

        //Array blank(arraySize);  //Розкоментувати рядок, для введення масива власноруч, а попередню закоментувати (Зроблено так бо дуже багато вибору по пунктам)

        //Заповнюємо наш масив масивів, масивом (blank) которий ми створили
        for (int i = 0; i < NumberOfSortType; i++)
            arrayToSort[i] = blank;  //blank - це зміннв нашого класу, її створили щоб потім нею заповнити наш масив масивів, щоб вони були однаковими

        //У залежності від вибору користувача виводимо йому те, що він обрав
        switch (choice) {
        case 0:
            cout << "Exit\n";
            break;

        case 1:
            cout << "Zero array analysis: " << endl;
            break;

        case 2:
            cout << "Random array analysis: " << endl;
            break;
        }

        //Якщо користувач обрав не вихід з програми 
        if (choice > 0) {
            analysis.sort_arrays(arrayToSort);  //Сотруємо наші масиви, для цього в метод класу Statistics передаємо посилання на наші масиви
            analysis.print_result();  //Друкуємо результат сортувань
            cout << "\nMinimal and Maximal elements are :" << arrayToSort[0].Min() << "  " << arrayToSort[0].Max() << "\n\n\n";  //Виводимо максимальний та мінімальний елементи масиву
        }
    } while (choice != 0);  //Поки користувач не введе 0 (вихід з програми) повторюємо її роботу

    //system("pause");
    return 0;
}
// Запуск програми: CTRL+F5 або меню "Отладка" > "Запуск без отладки"
// Отладка програми: F5 або меню "Отладка" > "Запустить отладку"

// Поради про початок роботи 
//   1. У вікні оглядача рішень можна додавати файли та керувати ними.
//   2. У вікні Team Explorer можна підключитися о системи керування версіями.
//   3. У вікні "Вихідні дані" можна переглядати вихідні дані збірки та інші повідомлення.
//   4. У вікні "Список помилок" можна переглядати помилки.
//   5. Послідовно оберіть пункти меню "Проект" > "Добавить новый элемент", щоб створити файли коду, або "Проект" > "Добавить существующий элемент", щоб додати до проекту існуючі файли коду.
//   6. Щоб знову відкрити цей проект пізніше, оберіть пункти меню "Файл" > "Открыть" > "Проект" та оберіть SLN-файл.